### 📖 Terraform Plan (src/core/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_access_policy.kv_common_infra_cd will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "kv_common_infra_cd" {
      ~ certificate_permissions = [
          - "Get",
          - "List",
        ]
        id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/objectId/19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"
      ~ key_permissions         = [
          - "Get",
          - "List",
        ]
      ~ secret_permissions      = [
            # (1 unchanged element hidden)
            "List",
          - "Delete",
            "Set",
          + "Delete",
        ]
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.kv_common_infra_ci will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "kv_common_infra_ci" {
      ~ certificate_permissions = [
          - "Get",
          - "List",
        ]
        id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/objectId/8d5d04c7-98f7-4f27-91ae-249231d96918"
      ~ key_permissions         = [
          - "Get",
          - "List",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.key_vault_weu.azurerm_key_vault.io_p_itn_kv_01 will be created
  + resource "azurerm_key_vault" "io_p_itn_kv_01" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-kv-01"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-common-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 15
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault_weu.azurerm_key_vault.tlscert_itn_01 will be updated in-place
  ~ resource "azurerm_key_vault" "tlscert_itn_01" {
        id                              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-tlscert-kv-01"
        name                            = "io-p-itn-tlscert-kv-01"
      ~ public_network_access_enabled   = false -> true
        tags                            = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
        # (12 unchanged attributes hidden)

      ~ network_acls {
          ~ default_action             = "Deny" -> "Allow"
            # (3 unchanged attributes hidden)
        }
    }

  # module.key_vault_weu.azurerm_private_endpoint.io_p_itn_kv_01 will be created
  + resource "azurerm_private_endpoint" "io_p_itn_kv_01" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-kv-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-common-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-kv-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_admins["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_admins["100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_admins["12a48460-7d95-4d91-ab0a-1d19008aac2c"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_admins["831e5214-2f68-4a13-b25f-7bec962c7e1b"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "831e5214-2f68-4a13-b25f-7bec962c7e1b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_admins["912c0ba1-90b5-47eb-83f7-bf1e1294cd5c"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_admins["a0ed72be-f9f9-407e-bf25-91761f8d3de7"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_admins["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_devs["0bd8a47e-3188-45c9-9c74-23f22fca2497"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_devs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0bd8a47e-3188-45c9-9c74-23f22fca2497"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_devs["300ea154-9984-4712-85e9-3abcb3e42960"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_devs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "300ea154-9984-4712-85e9-3abcb3e42960"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_devs["7b78851b-c40d-497d-ae7f-596b8f92ecf2"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_devs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_devs["861e7fd4-6463-4f69-b473-1e6aaaa4520e"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_devs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "861e7fd4-6463-4f69-b473-1e6aaaa4520e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_adgroup_devs["b2ca23d9-ace5-416d-8132-01d9b002db12"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_adgroup_devs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2ca23d9-ace5-416d-8132-01d9b002db12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_azdevops_platform_iac_cert will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_azdevops_platform_iac_cert" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "60210551-7492-4e02-a89e-0c9eda59bfec"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_azdevops_platform_iac_secret will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_azdevops_platform_iac_secret" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "60210551-7492-4e02-a89e-0c9eda59bfec"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_cd_cert["19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_cd_cert" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_cd_secret["19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_cd_secret" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_cdn_cert will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_cdn_cert" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f3b3f72f-4770-47a5-8c1e-aa298003be12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_cdn_secret will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_cdn_secret" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f3b3f72f-4770-47a5-8c1e-aa298003be12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_ci_cert["8d5d04c7-98f7-4f27-91ae-249231d96918"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_ci_cert" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8d5d04c7-98f7-4f27-91ae-249231d96918"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_kv_01_ci_secret["8d5d04c7-98f7-4f27-91ae-249231d96918"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_kv_01_ci_secret" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8d5d04c7-98f7-4f27-91ae-249231d96918"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 22 to add, 3 to change, 0 to destroy.
```

</details>
